{
  "_name_or_path": "sentence-transformers/all-MiniLM-L6-v2",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "id2label": {
    "0": "coding",
    "1": "writing",
    "2": "research",
    "3": "math",
    "4": "data_analysis",
    "5": "creative",
    "6": "planning",
    "7": "summarization",
    "8": "editing",
    "9": "brainstorming",
    "10": "qa",
    "11": "other"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "brainstorming": 9,
    "coding": 0,
    "creative": 5,
    "data_analysis": 4,
    "editing": 8,
    "math": 3,
    "other": 11,
    "planning": 6,
    "qa": 10,
    "research": 2,
    "summarization": 7,
    "writing": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
